
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |      24 |          3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                   |
|:--------:|:------------------------------------------------------------------------------------------------------------|
|    🟢     | `module.release_infrahouse_com["noble"].aws_acm_certificate.repo`                                           |
|    🟢     | `module.release_infrahouse_com["noble"].aws_acm_certificate_validation.repo`                                |
|    🟢     | `module.release_infrahouse_com["noble"].aws_cloudfront_cache_policy.default`                                |
|    🟢     | `module.release_infrahouse_com["noble"].aws_cloudfront_distribution.repo`                                   |
|    🟢     | `module.release_infrahouse_com["noble"].aws_cloudfront_function.http_auth`                                  |
|    🟢     | `module.release_infrahouse_com["noble"].aws_cloudfront_origin_access_control.repo-storage`                  |
|    🟢     | `module.release_infrahouse_com["noble"].aws_route53_record.cert_validation["release-noble.infrahouse.com"]` |
|    🟢     | `module.release_infrahouse_com["noble"].aws_route53_record.repo`                                            |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket.repo`                                                 |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket.repo-logs`                                            |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_acl.repo`                                             |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_acl.repo-logs`                                        |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_logging.server-logs`                                  |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_ownership_controls.repo`                              |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_ownership_controls.repo-logs`                         |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_policy.bucket-access`                                 |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_bucket_public_access_block.repo`                             |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_object.deb-gpg-public-key`                                   |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_object.distributions`                                        |
|    🟢     | `module.release_infrahouse_com["noble"].aws_s3_object.index-html`                                           |
|    🟢     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret.key`                                      |
|    🟢     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret.passphrase`                               |
|    🟢     | `module.release_infrahouse_com["noble"].aws_secretsmanager_secret_version.passphrase`                       |
|    🟢     | `module.release_infrahouse_com["noble"].random_password.passphrase`                                         |
|    🟡     | `aws_iam_policy.package-publisher`                                                                          |
|    🟡     | `module.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access`                                 |
|    🟡     | `module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access`                                 |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.package-publisher will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "package-publisher" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-focal/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-jammy/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP",
              + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP",
              + "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.package-publisher will be updated in-place
  ~ resource "aws_iam_policy" "package-publisher" {
        id               = "arn:aws:iam::493370826424:policy/package-publisher"
        name             = "package-publisher"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-release-focal/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::infrahouse-release-jammy/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq",
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG",
                          - "arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-focal"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action    = "s3:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                        Resource  = [
                            "arn:aws:s3:::infrahouse-release-focal/*",
                            "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::infrahouse-release-focal/*",
                          + "arn:aws:s3:::infrahouse-release-focal",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket-access" {
        id     = "infrahouse-release-jammy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action    = "s3:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                        }
                        Resource  = [
                            "arn:aws:s3:::infrahouse-release-jammy/*",
                            "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                  + {
                      + Action    = "s3:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::infrahouse-release-jammy/*",
                          + "arn:aws:s3:::infrahouse-release-jammy",
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.bucket-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-access" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-puppet-data-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-puppet-code-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-infrahouse-toolkit-github"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/jumphost-Zv01ElhajbB620240223005112032800000005"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = "s3:*"
                          + Effect    = "Allow"
                          + Principal = {
                              + AWS = "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin"
                            }
                          + Resource  = [
                              + "arn:aws:s3:::infrahouse-release-noble/*",
                              + "arn:aws:s3:::infrahouse-release-noble",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.release_infrahouse_com["noble"].data.aws_iam_policy_document.bucket-cloudfront-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket-cloudfront-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::infrahouse-release-noble/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.release_infrahouse_com["noble"].aws_acm_certificate.repo will be created
  + resource "aws_acm_certificate" "repo" {
      + arn                       = (known after apply)
      + domain_name               = "release-noble.infrahouse.com"
      + domain_validation_options = [
          + {
              + domain_name           = "release-noble.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "release-noble.infrahouse.com",
        ]
      + tags                      = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                  = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_acm_certificate_validation.repo will be created
  + resource "aws_acm_certificate_validation" "repo" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_cloudfront_cache_policy.default will be created
  + resource "aws_cloudfront_cache_policy" "default" {
      + default_ttl = 300
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 600
      + min_ttl     = 60
      + name        = "infrahouse-release-noble_default"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.release_infrahouse_com["noble"].aws_cloudfront_distribution.repo will be created
  + resource "aws_cloudfront_distribution" "repo" {
      + aliases                         = [
          + "release-noble.infrahouse.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                        = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = (known after apply)
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-infrahouse-release-noble"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "https-only"
        }

      + logging_config {
          + bucket          = (known after apply)
          + include_cookies = false
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3-infrahouse-release-noble"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "CN",
                  + "IR",
                  + "RU",
                ]
              + restriction_type = "blacklist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.release_infrahouse_com["noble"].aws_cloudfront_function.http_auth will be created
  + resource "aws_cloudfront_function" "http_auth" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
                var authHeaders = event.request.headers.authorization;
            
                // The Base64-encoded Auth string that should be present.
                // It is an encoding of `Basic base64([username]:[password])`
                // The username and password are:
                //      Username: john
                //      Password: foobar
                var expected = "Basic Og==";
            
                // If an Authorization header is supplied and it's an exact match, pass the
                // request on through to CF/the origin without any modification.
                if (authHeaders && authHeaders.value === expected) {
                    return event.request;
                }
            
                // But if we get here, we must either be missing the auth header or the
                // credentials failed to match what we expected.
                // Request the browser present the Basic Auth dialog.
                var response = {
                    statusCode: 401,
                    statusDescription: "Unauthorized",
                    headers: {
                        "www-authenticate": {
                            value: 'Basic realm="Enter credentials for this super secure site"',
                        },
                    },
                };
            
                return response;
            }
        EOT
      + comment         = "Enable HTTP basic authentication"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "release-noble_infrahouse_com-auth"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_cloudfront_origin_access_control.repo-storage will be created
  + resource "aws_cloudfront_origin_access_control" "repo-storage" {
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "repo-storage-noble"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.release_infrahouse_com["noble"].aws_route53_record.cert_validation["release-noble.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.release_infrahouse_com["noble"].aws_route53_record.repo will be created
  + resource "aws_route53_record" "repo" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "release-noble.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket.repo will be created
  + resource "aws_s3_bucket" "repo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-release-noble"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket.repo-logs will be created
  + resource "aws_s3_bucket" "repo-logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-release-noble-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_acl.repo will be created
  + resource "aws_s3_bucket_acl" "repo" {
      + acl    = "private"
      + bucket = "infrahouse-release-noble"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_acl.repo-logs will be created
  + resource "aws_s3_bucket_acl" "repo-logs" {
      + acl    = "private"
      + bucket = "infrahouse-release-noble-logs"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_logging.server-logs will be created
  + resource "aws_s3_bucket_logging" "server-logs" {
      + bucket        = "infrahouse-release-noble"
      + id            = (known after apply)
      + target_bucket = "infrahouse-release-noble-logs"
      + target_prefix = "server-side/"
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_ownership_controls.repo will be created
  + resource "aws_s3_bucket_ownership_controls" "repo" {
      + bucket = "infrahouse-release-noble"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_ownership_controls.repo-logs will be created
  + resource "aws_s3_bucket_ownership_controls" "repo-logs" {
      + bucket = "infrahouse-release-noble-logs"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_policy.bucket-access will be created
  + resource "aws_s3_bucket_policy" "bucket-access" {
      + bucket = "infrahouse-release-noble"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_bucket_public_access_block.repo will be created
  + resource "aws_s3_bucket_public_access_block" "repo" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "infrahouse-release-noble"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.deb-gpg-public-key will be created
  + resource "aws_s3_object" "deb-gpg-public-key" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-release-noble"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            -----BEGIN PGP PUBLIC KEY BLOCK-----
            
            mQINBGab5EUBEACxeA8zoBEYYqzp9cBjXouDZP2yuf7DSPSEzxcb6nV+KiIp6L3r
            nOTOni01dpN7REup0lp+zGCENWD0iNRrHgO0nkNauDSB34k8giuXLw5sS+syqr8u
            It0lmmqymdMqmmp1DDvDHmbRva/LcGZfXpWSovNwwL+GxGzaqnynJb/2lK9Q2Fu4
            4DLFC/Vyd3fSkGfRmiprhJc98ex84F+u1DcIXOuBsEEfylkJ4TNrar03GM1hXRV9
            8WQ7BCihNHY9jv30i/9ODhRfHtdgJmcBTHAudJ+W1X225qHnUbb162rFIRCoBZ/e
            08yy5Agwgv8v6gwLfmupaHjqXH/CRhGWJtyXbv02LtMUYRhAjgefWsYO/axyHU+b
            VhGJGjJYzINU1h6PV1ruxqgwEmwqfwviqhBflvzYGeDcPOhTzDMGF3obMrH6kWR4
            B5huogC9uTz391qivNiu4UC/B7zZpZTRx3inIcR7kc+Xp7apmZZeVex7+xb4Oj5m
            12JJC4kqQj8Q0HZX+KVnBciCzxrNz+vlQ1qG/ScXz1e3wP3Nb1EjGF+TUaPkO3vL
            IS5gBWCJx883cl6YkYXOAU6uw9HY3YpSLstApDDgxI6ju0p8RE+HOLFJyFLOwJfM
            cnrfLSNIQuXdpEj3afUNshb45ORXZLiWUDk07Zdir9i+/JE4SOFpRulATwARAQAB
            tF1JbmZyYUhvdXNlIFBhY2thZ2VyIChrZXkgZm9yIHNpZ25pbmcgVWJ1bnR1IG5v
            YmxlIHJlcG9zaXRvcnkpIDxwYWNrYWdlci1ub2JsZUBpbmZyYWhvdXNlLmNvbT6J
            AlcEEwEIAEEWIQSmJ7d2ABkLpRuQNFPTehgbaJrWGQUCZpvkRQIbAwUJA8JnAAUL
            CQgHAgIiAgYVCgkICwIEFgIDAQIeBwIXgAAKCRDTehgbaJrWGTjsD/9TNOxeKdT6
            5t/B0Qwkl+xr/SVZmaU5/NbEwXWv40o3+9sxRGASnQ09zE6bpGdzKdqEVPFeouFK
            YeDtHTOK20+siubHp2v4T0BDxM2NGGt9rwDFlv/JCnf7irbTwrSqco9XrM6Stt4d
            8viYev2rSXHfyDGnvGnZ35LUmHyGFlyzGPU9Mer7VskXND8e2BFxj7nGTLbVd76L
            KBP9dEYRb14FLZqKvxqqbfJtlXI6ggd7MuUln0iY0NqkYUCtNvP+GinNmcuekmBs
            ZsnDOKBEDWa0pD9bznKF6fVChwiG6iacH5nZteTQ9RNmMZhQ+E+0PMkiJya6u9P5
            +xP0iM984ocgzKCLY1fsJLQ7Fdnx0gQVKtKZ9bpAy/AX/n2Vtq1KRcPPuklQTbOv
            DxAj73mlJ/hReEWX9C/M8lMLgMDAMDQGNl/WTCuRPywSz1vwDuX1SKi0NJz9e76D
            qIGR3JHUI0cPrC89nYmEuH4PKjs+YDdhkVMxfHVW6k1sMcbrREvoRw2cqfbj96JO
            JSEAXEktdHnbCkQIwJTA363m+9XUK49koc5igsONG4+7Hoot+elP06WgelKPsWvj
            iCUXmo/zihhPa4U7+XlBXuDcDTNRkTsUs42vytgIpiZAGL3OzI5QzbZ4SqewL5sP
            qBtgNMjyIXc6hBlOVPbZadoVW3vNL+ke+bkCDQRmm+RFARAAutqQKo9noO20r2r/
            SZfGB9n21OJ+hhxWgiZhSFU4E6xfJj0Tr1MbbgJiyxEIERdpcG3LEkSBxLiqwF+j
            c1eHtDDzQl968AKLcxkjIqFXV1zWhSE1STUzZYrLxtJL0X60vyNerGcrIbx6tTxK
            2/THABeZoXjLCa4eYcP5qXXSk8iRn4i1EBS3hHN4uCDHptE5Pl93jWJmuwoEkYTx
            hy5R7xZGAKPu4ysfDmgIU8yXeY8CbwCca1kcoVyMZ4DEGIwh1JII6l3XA3VWrcoE
            5A814Akfvio4U9A26E4+aGg/QgmvoA5OptZ6ao3Wn/OIN7snxGgawCStOeWrXR9y
            fJa8HYXJDa/ToEty0OTxgiExQWYPTaO6Ad/c6cabIRqg3XvC2llh8FG5WNvP+4m/
            Fy3y2pDjyc2wELLBZVoL709FdtPF4ajQ5kCy7fUJ2/sqJDkTXta3qb4RpTFodJdB
            0wtgKfmwjE5/ojAYAEgIBVnxEw/s4z1Dc9kqpP4P4UEBqv8ZXpBpuzpctX3DIYAy
            oOU7Xe1CIaHdhP7lbrydoJTxrowR7Yz0tzothjWfFAqL1oe9XDrywb30+9CW4fC/
            oq18gzaqEAOL8WyF4v3BGsHuFZ34aPtfrGs5MeCoKqg8wzn/fvId0y6vWqatPfcs
            Ysn3DC97b58K28UQypp9HY9oaKkAEQEAAYkCPAQYAQgAJhYhBKYnt3YAGQulG5A0
            U9N6GBtomtYZBQJmm+RFAhsMBQkDwmcAAAoJENN6GBtomtYZjT8P/1rOc97Kk2fL
            dgUYP66MQ+51H1iFh4ejY3o0jxK3kCTE8IhrPeVNIoiLZohQgPrpDpQ9aQT2gjSa
            YPAU9zBl+WishQnrFfzvVTcO5PV0xhTKWtBtZdzFv0WcIRtm9gOYW5GhBm0Of5BE
            6QoxG84nAmf5eUdgxxQqPnWVFTnxxw+33CnvOB0ZYL2eoj6SEyma2tYrWLLtkTNq
            5NgSP0wGW4SFn0Aa/Ei3MFRKFUqiFzaey+vrWkhj0Vl5spxf1K6ydjilme5yVsbn
            gFyldN97T8Wrc4mHhMQ3/V19Dy7JG+tEaB6WDA+Fzx+q2j1x8LpTnG5hYJ8XO9Mo
            7JRqP0stkPwjzumcOWZdDFm4oZ80OzFO8JdiPHV/jKYeVUk452HCKTe8XIBOdHmc
            puYAjtWiQ+g9i2U8S2QhloocmYtIx4yRxgY9qzc17KFDGl/vajyi3XdyCueDKsp7
            QvjsgdmNmFud28wuv8hImRTP2Pl2rg17D3KcimQRn+GFBjiSl5Mdwyty9cjXXMej
            5Q5UDcZE9UbTjx8btNLenxeMuwXEx60C+9QSsYPAbXxVUQQQtRjJhzJv0xjqVxt0
            85fJV17UzzcmYvyNKXOweNvCpxWv/DYJNF94+ooY/roOJ4T2s240KENrM8h6NTex
            hd/2juxDPcRg6SsRk4tJWFFpkASrPx8P
            =ZhiE
            -----END PGP PUBLIC KEY BLOCK-----
        EOT
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "DEB-GPG-KEY-release-noble.infrahouse.com"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all               = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + version_id             = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.distributions will be created
  + resource "aws_s3_object" "distributions" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-release-noble"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            Codename: noble
            Components: main
            Architectures: amd64
            SignWith: packager-noble@infrahouse.com
        EOT
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "conf/distributions"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all               = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + version_id             = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_s3_object.index-html will be created
  + resource "aws_s3_object" "index-html" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "infrahouse-release-noble"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="utf-8">
                <meta name="viewport" content="width=device-width, initial-scale=1">
                <meta name="description" content="InfraHouse Releases Repository">
                <title>InfraHouse Releases Repository</title>
            <body>
            <!DOCTYPE html>
            <html lang="en">
            <head>
                <meta charset="utf-8">
                <meta name="viewport" content="width=device-width, initial-scale=1">
                <meta name="description" content="InfraHouse Ubuntu Packages Repository">
                <style>
                    pre {
                        display: block;
                        font-family: monospace;
                        white-space: pre;
                        border-style: dotted;
                        margin: 30px;
                        padding: 10px;
                    }
                </style>
                <title>InfraHouse Ubuntu Packages Repository</title>
            <body>
            <h1>Installation instructions</h1>
            
            <p>Download the repository public key and convert it into apt compatible format.</p>
            <pre>
            # Install dependencies
            apt-get update
            apt-get install gpg lsb-release curl
            
            # Add a GPG public key to verify InfraHouse packages
            mkdir -p /etc/apt/cloud-init.gpg.d/
            curl  -fsSL https://release-$(lsb_release -cs).infrahouse.com/DEB-GPG-KEY-release-$(lsb_release -cs).infrahouse.com \
                | gpg --dearmor -o /etc/apt/cloud-init.gpg.d/infrahouse.gpg
            </pre>
            
            <p>Add the InfraHouse repository source.</p>
            
            <pre>
            echo "deb [signed-by=/etc/apt/cloud-init.gpg.d/infrahouse.gpg] https://release-$(lsb_release -cs).infrahouse.com/ $(lsb_release -cs) main" \
                > /etc/apt/sources.list.d/infrahouse.list
            
            apt-get update
            </pre>
            </body>
            
            </body>
        EOT
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all               = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }
      + version_id             = (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret.key will be created
  + resource "aws_secretsmanager_secret" "key" {
      + arn                            = (known after apply)
      + description                    = "Signing GPG key for noble"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-key-noble"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret.passphrase will be created
  + resource "aws_secretsmanager_secret" "passphrase" {
      + arn                            = (known after apply)
      + description                    = "Passphrase for a signing GPG key for noble"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "packager-passphrase-noble"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "created_by_module" = "infrahouse/debian-repo/aws"
        }
      + tags_all                       = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/debian-repo/aws"
          + "environment"       = "production"
        }

      + replica (known after apply)
    }

  # module.release_infrahouse_com["noble"].aws_secretsmanager_secret_version.passphrase will be created
  + resource "aws_secretsmanager_secret_version" "passphrase" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.release_infrahouse_com["noble"].random_password.passphrase will be created
  + resource "random_password" "passphrase" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 21
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 24 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDI0LCAiY2hhbmdlIjogMywgImRlc3Ryb3kiOiAwfX0=
```
</details>